// --створити масив та вивести його в консоль:
// - з 5 числових значень
// let one = [12, 34 , 55 , 77 , 88];
// console.log(one);
//

// - з 5 стічкових значень
// let one = ["one", "two", "three", "four", "five"];
// console.log(one);

// - з 5 значень стрічкового, числового та булевого типу
// let one = ["one", 23, true, "next", 12,];
// console.log(one);

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
// let one = [];
// one.push(23, 45, 64, true);
// one.unshift("zero", "five", false);
// console.log(one);
//

// За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
//
// for (let i = 0; i < 10; i++) {
//     document.write("<div>Hello world</div>");
// }

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
//
// for (let i = 0; i < 10; i++) {
//     document.write(`<div>hello world${i}</div>`);
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
//
// let start = 0;
// while (start < 20){
//     document.write("<h1>hello world</h1>");
//     start++
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині
// let start = 0;
// while (start < 20){
// document.write(`<h1>hello world ${start}</h1>`);
//    start++
// }

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// let numbers = [2, 5, 10, 43, 53, 12, 34, 87, 76, 100];
//     console.log(numbers);
//


// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі
//
// let start = ["one", "two", "three", "four", "five", "six", "seven", "eight", "nine", "ten"];
// for (let i = 0; i < start.length; i++) {
//     console.log(start[i]);
// }
//

//- Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// let a = [true, 12, "zero", "hello", 34, 55, 76, false, "arr", "finish"];
// for (let i = 0; i < a.length; i++) {
//     console.log(a[i]);
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// let start = [true, "zero", 13, 44, "go", false, 55, true, 99, true];
// for ( let i = 0; i < start.length; i++){
//     if (typeof start[i] === "boolean"){
//         console.log(i);
//     }
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// let start = [true, "zero", 13, 44, "go", false, 55, true, 99, true];
// for (let i = 0; i < start.length; i++) {
//     if (typeof start[i] === "number"){
//         console.log(i);
//     }
// }

// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
// let start = [true, "zero", 13, 44, "go", false, 55, true, 99, true];
// for (let i = 0; i < start.length; i++) {
//        if (typeof start[i] === "string"){
//            console.log(i);
//        }
// }

// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// let start = [];
// start.push(123, "hello", 432, 678, true, "world", false, 89, true, "finish");
// for (let i = 0; i < start.length; i++) {
//     console.log(start[i]);
// }

// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i < 10; i++) {
// console.log(i);
// document.write(i);
// }

// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
//  for (let i = 0; i < 100; i++){
//     console.log(i);
//     document.write(i);
// }

// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i < 200; i+=2){
//     console.log(i);
//      document.write(i + "<br>");
//  }

// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// for (let i = 0; i < 100; i++) {
//     if (i % 2 === 0){
//         console.log(i);
//         document.write(i);
//     }
// }

// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
// for (let i = 0; i < 100; i++) {
//     if (i % 2 !== 0){
//         console.log(i);
//         document.write(i);
//     }
// }

// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди
//  for (let i = 0; i < 2; i++) {
//     for (let j = 0; j < 60; j++) {
//         console.log(i+":"+j);
//     }
// }

// - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
//  for (let i = 0; i < 3; i++) {
//      for (let j = 0; j < 60; j++) {
//        for (let k = 0; k < 60; k++) {
//            console.log(i+":"+j+":"+k);
//             if (i === 2 && j === 20)
//                 break
//         }
//         if (i === 2 && j === 20)
//             break } }
//

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// let array = ['a', 'b', 'c'];
// let a = "";
// for (let i = 0; i < array.length; i++) {
//     a += array[i];
// }
// console.log(a);
//

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово
// let array = [ 'a', 'b', 'c'];
// let i = 0;
// let a = "";
// while (i < 3){
//     a += array[i];
//     i++
// }
// console.log(a);
//

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// let array = [ 'a', 'b', 'c'];
// let a = "";
// for (let string of array) {
//     a += string;
// }
// console.log(a);
//

// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
// let array = ['a', 'b', 'c'];
// for (let i = 1; i < 4; i++) {
//     array.push(i);
// }
// console.log(array);
//

// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1]
// let array = [1, 2, 3];
// let a = [];
// for (let i = 2; i >= 0 ; i--) {
//     a.push(array[i]);
// }
// console.log(a);
//

// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
// let array = [1, 2, 3];
// for (let i = 4; i < 7; i++) {
//     array.push(i);
// }
// console.log(array);
//

// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
// let array = [1, 2, 3];
// for (let i = 6; i >= 4 ; i--) {
//    array.unshift(i);
// }
// console.log(array)
//

// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
// let array = ['js', 'css', 'jq'];
// console.log(array.shift(array[0]));
//

// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
// let arr = ['js', 'css', 'jq'];
// console.log(arr.pop(arr[2]));
//

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].
// let arr = [1, 2, 3, 4, 5];
// let a = arr.slice(3);
// console.log(a);
//

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2]
// let arr = [1, 2, 3, 4, 5];
// let a = arr.slice(0,2);
// console.log(a);
//

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].
// let arr = [1, 2, 3, 4, 5];
// arr.splice(1,2);
// console.log(arr);
//

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// let arr =  [1, 2, 3, 4, 5];
// arr.splice(3, 0, "a", "b", "c");
// console.log(arr);
//

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
// let arr = [1, 2, 3, 4, 5];
// arr.splice(1,0,"a", "b");
// arr.splice(6, 0, "c");
// arr.splice(8, 0, "e");
// console.log(arr);
//

// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// for (let i = 0; i < arr.length; i++) {
//     if (i % 2 === 0){
//         console.log(i);}
// }
//

// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
// let arr = [1, 3, 6, 7, 9, 0 ,10, 14, 20 ,45];
// let a = [];
// for (let i = 0; i < arr.length; i++) {
//     a.push(arr[i]);
// }
// console.log(a);
//

// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший
// let arr = [1, 3, 6, 7, 9, 0 ,10, 14, 20 ,45];
// let a =[];
// for (let i = 0; i < arr.length; i++) {
//     a[i] = (arr[i]);
//     console.log(a[i]);
// }



// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// 1. перебрати його циклом while
// let arr = [2,17,13,6,22,31,45,66,100,-18];
// let i = 0;
// while (i < 10){
//     console.log(arr[i]);
//     i++;
// }
//
//2. перебрати його циклом for
// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for (let i = 0; i < arr.length; i++) {
//     console.log(arr[i]);
// }
//
//3. перебрати циклом while та вивести  числа тільки з непарним індексом
// let arr = [2,17,13,6,22,31,45,66,100,18];
// let i = 1;
// while (i < 10) {
//           console.log(arr[i]);
//       i+=2;
// }
//
//4. перебрати циклом for та вивести  числа тільки з непарним індексом
// let arr = [2,17,13,6,22,31,45,66,100,18];
// for (let i = 1; i < arr.length; i+=2) {
//          console.log(arr[i]);
//
// }
//
// 5. перебрати циклом while та вивести  числа тільки парні  значення
//
// let arr = [2,17,13,6,22,31,45,66,100,18];
// let i = 0;
// while (i < 10){
//     if (arr[i]%2 === 0){
//         console.log(arr[i]);
//
//     }i++;
// }
//
//6. перебрати циклом for та вивести  числа тільки парні  значення
// let arr = [2,17,13,6,22,31,45,66,100,18];
// for (let i = 0; i < arr.length; i++) {
//     if (arr[i]%2 === 0){
//         console.log(arr[i]);
//     }
// }
//
//7. замінити кожне число кратне 3 на слово "okten"
// let arr = [2,17,13,6,22,31,45,66,100,18];
// for (let i = 0; i < arr.length; i++) {
//    if (arr[i]%3 === 0){
//        arr[i] = "okten";
//    }
// }
// console.log(arr);
//
//8. вивести масив в зворотньому порядку.
// let arr = [2,17,13,6,22,31,45,66,100,18];
// for (let i = 9; i >= 0; i--) {
//     console.log(arr[i]);
// }


//9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//
// 1. перебрати його циклом while
// let arr = [2,17,13,6,22,31,45,66,100,-18];
// let i = 9;
// while (i >= 0)
// { console.log(arr[i]);
//     i--;
//  }
//
// 2. перебрати його циклом for
// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for (let i = 9; i >= 0; i--) {
//     console.log(arr[i]);
// }
//
// //3. перебрати циклом while та вивести  числа тільки з непарним індексом
// let arr = [2,17,13,6,22,31,45,66,100,18];
// let i = 9;
// while (i >= 1) {
//           console.log(arr[i]);
//       i-=2;
// }
//
//4. перебрати циклом for та вивести  числа тільки з непарним індексом
// let arr = [2,17,13,6,22,31,45,66,100,18];
// for (let i = 9; i >= 1; i-=2) {
//          console.log(arr[i]);
//
// }
//
// 5. перебрати циклом while та вивести  числа тільки парні  значення
//
// let arr = [2,17,13,6,22,31,45,66,100,18];
// let i = 9;
// while (i >= 0){
//     if (arr[i]%2 === 0){
//         console.log(arr[i]);
//
//     }i--;
// }
//
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// let arr = [2,17,13,6,22,31,45,66,100,18];
// for (let i = 9; i >= 0; i--) {
//     if (arr[i]%2 === 0){
//         console.log(arr[i]);
//     }
// }
//
// 7. замінити кожне число кратне 3 на слово "okten"
// let arr = [2,17,13,6,22,31,45,66,100,18];
// for (let i = 9; i >= 0; i--) {
//    if (arr[i]%3 === 0){
//        arr[i] = "okten";
//    }
// }
// console.log(arr);
//

// 10створити пустий масив та :
// 1. заповнити його 50 парними числами за допомоги циклу.
// let arr = [];
// for (let i = 0; i < 100; i+=2) {
//     arr.push(i);
// }
// console.log(arr);
//
//2. заповнити його 50 непарними числами за допомоги циклу
// let arr = [];
// for (let i = 1; i < 100; i+=2) {
//     arr.push(i);
// }
// console.log(arr);
//
//3. используя Math.random заполнить массив из ???(сколько хотите) элементов.
//  диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)
// let arr = [];
// for (let i = 0; i < 10; i++) {
//      arr[i] = Math.floor((Math.random()*732-8)+8);
//  }
// console.log(arr);
// 2. вывести на консоль  каждый третий елемент
// for (let i = 2; i < arr.length; i+=3) {
//     console.log(arr[i]);
// }
// 3. вывести на консоль  каждый третий елемент
//  но при условии что его значение является парным.
// for (let i = 2; i < arr.length; i+=3) {
//     if (arr[i]%2 === 0){
//         console.log(arr[i]);
//     }
// }
// 4. вывести на консоль  каждый третий елемент
// но при условии что он имеет парное значение и
// записать их в другой массив.
//
// let a = [];
// for (let i = 2; i < arr.length; i+=3) {
//     if (arr[i]%2 === 0){
//         a.push(arr[i]);
//
//     }
// }console.log(a);
//
// 5. Вывести каждый елемент массива у которого соседний с права элемент - парный
//
// for (let i = 0; i < arr.length-1; i++) {
//     if (arr[i+1]%2 === 0){
//         console.log(arr[i]);
//     }
// }
//
//5 масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.
// let arr = [100,250,50,168,120,345,188];
// let sum = 0;
// for (let i = 0; i < arr.length; i++) {
//     sum += arr[i];
// }
// console.log(sum/arr.length);
//
//3 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив
// let arr = [];
// let a =[];
// for (let i = 0; i < 10; i++) {
//      arr[i] = Math.floor((Math.random()*732-8)+8);
//  }
// for (let i = 0; i < arr.length; i++) {
//     a.push(arr[i]*5);
// }
// console.log(a);
//
//4 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
//  додати його в інший масив.
// let arr = ["hello", 13, true, 45, false, "bye", 77, "finish"];
// let a = [];
// for (let i = 0; i < arr.length; i++) {
//     if (typeof arr[i] === "number"){
//         a.push(arr[i]);
//     }
// }
// console.log(a);
//
// 10 hours later FINISH